{
  "ISTJ": "Serious and reliable, ISTJ emphasizes adherence to established guidelines, dedicated work practices, and the preservation of tradition. They frequently discuss methodical organization and structured planning in both personal and professional contexts, as well as their systematic approach to managing responsibilities and fulfilling commitments.",
  "ISFJ": "ISFJ communications reflect their supportive and caring nature, focusing on maintaining stability and harmony in everyday life. They often highlight how they attend to the needs and feelings of friends, family, and community members, showing meticulous attention to emotional well-being and the continuity of trusted relationships.",
  "INFJ": "INFJ posts tend to involve thoughtful introspection, exploring deeper interpersonal connections, and the search for meaning and purpose in work and personal pursuits. They may emphasize ideals, creative expression, and the desire to foster genuine understanding and purposeful engagement.",
  "INTJ": "INTJ discussions often center on strategic thinking and systematic execution of personal initiatives. They consider logic, efficiency, and long-term planning while approaching personal development and professional challenges, demonstrating a strong commitment to continuous growth and innovation.",
  "ISTP": "ISTP commentary highlights practical problem-solving, calm adaptability, and the effective use of tools or technology. They frequently demonstrate how they make swift, objective decisions under varying circumstances, focusing on skillful application and confident action in everyday situations.",
  "ISFP": "ISFP posts convey an appreciation for aesthetics and sensitivity to emotional nuances. They discuss ways of finding and creating meaningful, beautiful moments, maintaining a low-key yet authentic presence in social settings, and expressing themselves through subtle, personally resonant experiences.",
  "INFP": "INFP posts reveal an inner world guided by personal values, creativity, and a desire for true understanding in relationships. They often share reflections on art, deeply felt principles, and the importance of nurturing meaningful connections that honor individual authenticity and empathy.",
  "INTP": "INTP commentary typically delves into exploration of theories, logical complexity, and a persistent quest for knowledge. They discuss how they approach intricate intellectual challenges, seeking clarity and rational insight in the pursuit of deeper comprehension and conceptual refinement.",
  "ESTP": "ESTP posts frequently highlight active engagement, direct problem-solving, and enjoyment of the present moment. They discuss handling urgent situations, embracing adventure in social activities, and capturing excitement in everyday experiences, conveying confidence and a readiness for action.",
  "ESFP": "ESFP communications celebrate social interaction, lively energy, and the pleasure of shared experiences. They describe how they contribute fun and spontaneity to group dynamics, expressing themselves openly and encouraging others to embrace the vibrancy and enjoyment of collective activities.",
  "ENFP": "ENFP posts often showcase enthusiasm for new ideas, personal growth opportunities, and collaborative ventures. They discuss motivating and inspiring others, championing freedom of expression, and creatively exploring possibilities that spark curiosity, innovation, and heartfelt participation.",
  "ENTP": "ENTP commentary reflects a dynamic engagement with debate, strategic thinking, and the pursuit of unconventional solutions. They frequently challenge established viewpoints, encourage critical discourse, and explore novel ideas, demonstrating skillful reasoning and inventive approaches to problem-solving.",
  "ESTJ": "ESTJ posts emphasize efficiency, structured organization, and decisive leadership. They focus on how they manage both social and professional activities with order and clarity, ensuring that responsibilities are met, standards are upheld, and collective objectives are achieved through diligent execution.",
  "ESFJ": "ESFJ communications center on fostering harmony, caring for others¡¯ emotional well-being, and coordinating community-oriented activities. They often highlight their dedication to maintaining supportive relationships, encouraging participation, and attentively addressing the needs and feelings of those around them.",
  "ENFJ": "ENFJ posts are marked by their efforts to encourage and support others, guiding teams and communities toward shared understanding and unity. They discuss empathizing with emotional needs, inspiring collective growth, and contributing positively to group endeavors through inclusive and emotionally intelligent leadership.",
  "ENTJ": "ENTJ discussions revolve around goal attainment, strategic planning, and effective team management. They demonstrate confidence in decision-making and a direct approach to leadership, focusing on optimizing results, motivating others, and ensuring that objectives are met with clarity and purpose."
}
