{
  "ISTJ": "Serious and reliable, ISTJ emphasizes adherence to rules, dedication at work, and value for tradition. ISTJ often discusses organizing and planning in personal and professional settings and how they handle responsibilities and commitments.",
  "ISFJ": "ISFJ expresses in their communications how they support friends and family in everyday life, their efforts to maintain stability and harmony, and how they care meticulously for others' needs and feelings.",
  "INFJ": "INFJ posts may contain discussions about seeking deeper interpersonal relationships, how they find meaning and goals in work and personal life, and how they handle their creativity and idealism.",
  "INTJ": "INTJ might discuss their planning and execution of personal projects, how they handle situations requiring logic and efficiency, and their relentless pursuit of professional growth and learning.",
  "ISTP": "ISTP might describe how they make quick and effective decisions on practical problems, their use of technology or tools, and how they maintain calmness and objectivity in everyday life.",
  "ISFP": "ISFP posts may focus on their pursuit of aesthetics, how they find and create beautiful moments in life, and their low-key and sensitive presence in social settings.",
  "INFP": "INFP might share their inner worlds, how they make decisions based on personal values, their love for art and creativity, and how they seek true understanding and connections in relationships.",
  "INTP": "INTP might discuss their exploration of theories, how they tackle complex logical problems, and their desire for knowledge and understanding.",
  "ESTP": "ESTP might talk about their adventurous experiences in social activities, how they handle emergencies, and how they seek excitement and fun in everyday life.",
  "ESFP": "ESFP posts might include how they enjoy social activities in life, how they bring fun and energy to groups, and their love for spontaneity and free expression.",
  "ENFP": "ENFP might express their enthusiasm for new ideas and opportunities, how they motivate and influence others in daily life, and their pursuit of freedom and creativity.",
  "ENTP": "ENTP might discuss their love for debate and strategy, how they seek and challenge new ideas in discussions, and how they handle innovation and problem-solving.",
  "ESTJ": "ESTJ might emphasize their pursuit of efficiency and order, how they take on leadership roles in work and social activities, and their strictness and decisiveness in execution and management.",
  "ESFJ": "ESFJ might discuss their efforts to maintain harmony in social and family settings, how they care for others' feelings and needs, and their enthusiasm and commitment in organizing social activities.",
  "ENFJ": "ENFJ posts might include how they encourage and support others, their leadership role in teams and communities, and how they seek to understand and respond to the emotional needs of others.",
  "ENTJ": "ENTJ might discuss their experiences in pursuing goals and strategic planning, how they manage and motivate teams to achieve efficient results, and their decisiveness and confidence in leadership and decision-making."
}