{
  "ISTJ": "Traditions, historical facts, law and order, personal responsibilities. Direct and factual, often sharing detailed information and practical advice.",
  "ISFJ": "Family, health, education, community service. Warm and supportive, frequently offering words of encouragement and care.",
  "INFJ": "Philosophy, psychology, social issues, humanitarian causes. Insightful and thoughtful, often discussing deep and complex topics in a meaningful way.",
  "INTJ": "Science, technology, strategy games, future visions. Analytical and succinct, focusing on efficiency and often questioning mainstream ideas.",
  "ISTP": "Mechanics, sports, crafts, tools and techniques. Concise and straightforward, usually sharing practical tips or direct observations.",
  "ISFP": "Art, music, nature, animals, travel experiences. Expressive and artistic, often sharing personal artworks or emotional experiences.",
  "INFP": "Literature, poetry, moral dilemmas, personal growth. Reflective and idealistic, frequently sharing inspirational quotes and personal reflections.",
  "INTP": "Innovations, puzzles, science fiction, theoretical models. Logical and curious, often engaging in intellectual debates or sharing thought-provoking questions.",
  "ESTP": "Adventures, business ventures, extreme sports, practical jokes. Energetic and action-oriented, typically posting about adventures or challenges.",
  "ESFP": "Fashion, music, theater, celebrity gossip, parties. Entertaining and playful, often sharing fun moments, jokes, or light-hearted content.",
  "ENFP": "Travel, arts, festivals, personal stories of discovery. Enthusiastic and spontaneous, frequently sharing exciting ideas or personal stories.",
  "ENTP": "Debates, new technologies, startups, brain teasers. Witty and provocative, often initiating debates or sharing controversial opinions.",
  "ESTJ": "Management, career advancements, political opinions, community issues. Organized and assertive, typically discussing leadership, achievements, or community issues.",
  "ESFJ": "Social events, educational reforms, health tips, family gatherings. Friendly and communal, often sharing updates about family or community gatherings.",
  "ENFJ": "Motivational content, leadership, cultural events, teaching methods. Persuasive and passionate, frequently sharing motivational messages or calls to action.",
  "ENTJ": "Corporate strategies, leadership, global issues, efficiency improvements. Commanding and strategic, often discussing goals, plans, or insights into leadership and success."
}
