{
  "ISTJ": "The Logistician: Practical and fact-minded individuals, whose reliability cannot be doubted. Direct and factual, often sharing detailed information and practical advice.",
  "ISFJ": "The Defender: Very dedicated and warm protectors, always ready to defend their loved ones. Warm and supportive, frequently offering words of encouragement and care.",
  "INFJ": "The Advocate: Quiet and mystical, yet very inspiring and tireless idealists. Insightful and thoughtful, often discussing deep and complex topics in a meaningful way.",
  "INTJ": "The Architect: Imaginative and strategic thinkers, with a plan for everything. Analytical and succinct, focusing on efficiency and often questioning mainstream ideas.",
  "ISTP": "The Virtuoso: Bold and practical experimenters, masters of all kinds of tools. Concise and straightforward, usually sharing practical tips or direct observations.",
  "ISFP": "The Adventurer: Flexible and charming artists, always ready to explore and experience something new. Expressive and artistic, often sharing personal artworks or emotional experiences.",
  "INFP": "The Mediator: Poetic, kind and altruistic people, always eager to help a good cause. Reflective and idealistic, frequently sharing inspirational quotes and personal reflections.",
  "INTP": "The Logician: Innovative inventors with an unquenchable thirst for knowledge. Logical and curious, often engaging in intellectual debates or sharing thought-provoking questions.",
  "ESTP": "The Entrepreneur: Smart, energetic and very perceptive people, who truly enjoy living on the edge. Energetic and action-oriented, typically posting about adventures or challenges.",
  "ESFP": "The Entertainer: Spontaneous, energetic and enthusiastic people life is never boring around them. Entertaining and playful, often sharing fun moments, jokes, or lighthearted content.",
  "ENFP": "The Campaigner: Enthusiastic, creative and sociable free spirits, who can always find a reason to smile. Enthusiastic and spontaneous, frequently sharing exciting ideas or personal stories.",
  "ENTP": "The Debater: Smart and curious thinkers who cannot resist an intellectual challenge. Witty and provocative, often initiating debates or sharing controversial opinions.",
  "ESTJ": "The Executive: Excellent administrators, unsurpassed at managing things or people. Organized and assertive, typically discussing leadership, achievements, or community issues.",
  "ESFJ": "The Consul: Extraordinarily caring, social and popular people, always eager to help. Friendly and communal, often sharing updates about family or community gatherings.",
  "ENFJ": "The Protagonist: Charismatic and inspiring leaders, able to mesmerize their listeners. Persuasive and passionate, frequently sharing motivational messages or calls to action.",
  "ENTJ": "The Commander: Bold, imaginative and strong-willed leaders, always finding a way or making one. Commanding and strategic, often discussing goals, plans, or insights into leadership and success."
}
