{
  "ISTJ": "The Logistician: Practical and fact-minded individuals, whose reliability cannot be doubted. Topics of interest include traditions, historical facts, law and order, and personal responsibilities.",
  "ISFJ": "The Defender: Very dedicated and warm protectors, always ready to defend their loved ones. Topics of interest include family, health, education, and community service.",
  "INFJ": "The Advocate: Quiet and mystical, yet very inspiring and tireless idealists. Topics of interest include philosophy, psychology, social issues, and humanitarian causes.",
  "INTJ": "The Architect: Imaginative and strategic thinkers, with a plan for everything. Topics of interest include science, technology, strategy games, and future visions.",
  "ISTP": "The Virtuoso: Bold and practical experimenters, masters of all kinds of tools. Topics of interest include mechanics, sports, crafts, and tools and techniques.",
  "ISFP": "The Adventurer: Flexible and charming artists, always ready to explore and experience something new. Topics of interest include art, music, nature, animals, and travel experiences.",
  "INFP": "The Mediator: Poetic, kind and altruistic people, always eager to help a good cause. Topics of interest include literature, poetry, moral dilemmas, and personal growth.",
  "INTP": "The Logician: Innovative inventors with an unquenchable thirst for knowledge. Topics of interest include innovations, puzzles, science fiction, and theoretical models.",
  "ESTP": "The Entrepreneur: Smart, energetic and very perceptive people, who truly enjoy living on the edge. Topics of interest include adventures, business ventures, extreme sports, and practical jokes.",
  "ESFP": "The Entertainer: Spontaneous, energetic and enthusiastic people life is never boring around them. Topics of interest include fashion, music, theater, celebrity gossip, and parties.",
  "ENFP": "The Campaigner: Enthusiastic, creative and sociable free spirits, who can always find a reason to smile. Topics of interest include travel, arts, festivals, and personal stories of discovery.",
  "ENTP": "The Debater: Smart and curious thinkers who cannot resist an intellectual challenge. Topics of interest include debates, new technologies, startups, and brain teasers.",
  "ESTJ": "The Executive: Excellent administrators, unsurpassed at managing things or people. Topics of interest include management, career advancements, political opinions, and community issues.",
  "ESFJ": "The Consul: Extraordinarily caring, social and popular people, always eager to help. Topics of interest include social events, educational reforms, health tips, and family gatherings.",
  "ENFJ": "The Protagonist: Charismatic and inspiring leaders, able to mesmerize their listeners. Topics of interest include motivational content, leadership, cultural events, and teaching methods.",
  "ENTJ": "The Commander: Bold, imaginative and strong-willed leaders, always finding a way or making one. Topics of interest include corporate strategies, leadership, global issues, and efficiency improvements."
}
